# Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.

print('Выполним битовые операции над числами 5 и 6.')
print(f'Битовое "AND": 5 & 6 = {5 & 6}')
print(f'Битовое "OR": 5 | 6 = {5 | 6}')
print(f'Битовое "XOR": 5 ^ 6 = {5 ^ 6}')
print(f'Битовое отрицание числа 5: ~ 5 = {~5}')
print(f'Битовое отрицание числа 6: ~ 6 = {~6}')
print(f'Битовый сдвиг влево числа 5 на два знака: 5 << 2 = {5 << 2}')
print(f'Битовый сдвиг вправо числа 5 на два знака: 5 >> 2 = {5 >> 2}')
